wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    SPIM_SET_SS_EN(spim, 1);                          /* CS activated. */
    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(spim, u32NBit);
    spim_read(spim, dataBuf, u32NRx);
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated. */
}

/**
  * @brief      Check if Erase/Write is done.
  * @return     0: Not done. 1: Done.
  */
static int spim_is_write_done(SPIM_T *spim, uint32_t u32NBit)
{
    uint8_t status[1];
    SPIM_ReadStatusRegister(spim, status, sizeof(status), u32NBit);
    return !(status[0] & SR_WIP);
}

/**
  * @brief      Wait until Erase/Write done.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     0           SPIM write done.
  */
int SPIM_Wait_Write_Done(SPIM_T *spim, uint32_t u32NBit)
{
    uint32_t   count;
    int        ret = -1;

    for (count = 0UL; count < SystemCoreClock / 1000UL; count++)
    {
        if (spim_is_write_done(spim, u32NBit))
        {
            ret = 0;
            break;
        }
    }

    if (ret != 0)
    {
        SPIM_DBGMSG("SPIM_Wait_Write_Done time-out!!\n");
    }

    return ret;
}

/**
  * @brief      Issue Write Enable/disable command.
  * @param      isEn        Enable/disable.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_Set_Write_Enable(SPIM_T *spim, int isEn, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {0U};                     /* 1-byte Write Enable command. */
    cmdBuf[0] = isEn ? OPCODE_WREN : OPCODE_WRDI;

    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.   */
    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */
}

/** @endcond HIDDEN_SYMBOLS */

/**
  * @brief      Get SPIM serial clock.
  * @return     SPI serial clock.
  * @details    This function calculates the serial clock of SPI in Hz.
  */
uint32_t SPIM_GetSClkFreq(SPIM_T *spim)
{
    uint32_t clkDiv = SPIM_GET_CLOCK_DIVIDER(spim);

    return clkDiv ? SystemCoreClock / (clkDiv * 2U) : SystemCoreClock;
}

/**
  * @brief      Initialize SPIM flash.
  * @param      clrWP       Clear Write Protect or not.
  * @return     0    Success.
  * @return     -1   Unrecognized manufacture ID or failed on reading manufacture ID.
  */
int SPIM_InitFlash(SPIM_T *spim, int clrWP)
{
    uint8_t   idBuf[3];
    uint8_t   cmdBuf[1];
    uint32_t  i;
    int32_t   ret = -1;

    SPIM_SET_SS_ACTLVL(spim, 0);

    /*
     * Because not sure in SPI or QPI mode, do QPI reset and then SPI reset.
     */
    /* QPI Reset Enable */
    cmdBuf[0] = OPCODE_RSTEN;
    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */
    SPIM_ENABLE_QUAD_OUTPUT_MODE(spim);               /* 1-bit, Output.   */
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */

    /* QPI Reset */
    cmdBuf[0] = OPCODE_RST;
    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */
    SPIM_ENABLE_QUAD_OUTPUT_MODE(spim);               /* 1-bit, Output.   */
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */

    /* SPI ResetEnable */
    cmdBuf[0] = OPCODE_RSTEN;
    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */
    SPIM_ENABLE_SING_OUTPUT_MODE(spim);               /* 1-bit, Output.   */
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */

    /* SPI Reset */
    cmdBuf[0] = OPCODE_RST;
    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */
    SPIM_ENABLE_SING_OUTPUT_MODE(spim);               /* 1-bit, Output.   */
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */

    if (clrWP)
    {
        uint8_t dataBuf[] = {0x00U};

        SPIM_Set_Write_Enable(spim, 1, 1UL);          /* Clear Block Protect. */
        SPIM_WriteStatusRegister(spim, dataBuf, sizeof(dataBuf), 1U);
        SPIM_Wait_Write_Done(spim, 1UL);
    }

    SPIM_ReadJedecId(spim, idBuf, sizeof(idBuf), 1UL);

    /* printf("ID: 0x%x, 0x%x, px%x\n", idBuf[0], idBuf[1], idBuf[2]); */

    for (i = 0UL; i < sizeof(g_Supported_List) / sizeof(g_Supported_List[0]); i++)
    {
        if (idBuf[0] == g_Supported_List[i])
        {
            ret = 0;
        }
    }

    if (ret != 0)
    {
        SPIM_DBGMSG("Flash initialize failed!! 0x%x\n", idBuf[0]);
    }

    return ret;
}

/**
  * @brief      Issue JEDEC ID command.
  * @param      idBuf       ID buffer.
  * @param      u32NRx      Size of ID buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_ODTRReadJedecId(SPIM_T *spim, uint8_t idBuf[], uint32_t u32NRx, uint32_t u32NBit, uint32_t u32DTRMode)
{
    uint8_t cmdBuf[2] = { OPCODE_RDID }; /* 1-byte JEDEC ID command.  */
    uint8_t u8CmdSize = 1;
    SPIM_SET_DTR_MODE(spim, u32DTRMode); /* DTR Activated. */

    SPIM_SET_SS_EN(spim, 1);            /* CS activated.    */

    SwitchNBitOutput(spim, u32NBit);

    if (u32DTRMode == 1)
    {
        cmdBuf[0] = OPCODE_RDID;
        cmdBuf[1] = OPCODE_RDID;
        u8CmdSize = 2;
    }

    spim_write(spim, cmdBuf, u8CmdSize);

    SPIM_SET_DTR_MODE(spim, 0); /* DTR Activated. */
    SwitchNBitOutput(spim, 1);
    cmdBuf[0] = 0x0;
    spim_write(spim, cmdBuf, 1);

    SPIM_SET_DTR_MODE(spim, u32DTRMode); /* DTR Activated. */
    SwitchNBitInput(spim, u32NBit);
    spim_read(spim, idBuf, u32NRx);
    SPIM_SET_SS_EN(spim, 0);            /* CS deactivated.  */

    SPIM_SET_DTR_MODE(spim, 0); /* DTR Activated. */
}


/**
  * @brief      Issue JEDEC ID command.
  * @param      idBuf       ID buffer.
  * @param      u32NRx      Size of ID buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_ReadJedecId(SPIM_T *spim, uint8_t idBuf[], uint32_t u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = { OPCODE_RDID }; /* 1-byte JEDEC ID command.  */

    SPIM_SET_SS_EN(spim, 1);            /* CS activated.    */

    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(spim, u32NBit);
    spim_read(spim, idBuf, u32NRx);
    SPIM_SET_SS_EN(spim, 0);            /* CS deactivated.  */
}

