wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
/** @cond HIDDEN_SYMBOLS */

static void spim_enable_spansion_quad_mode(SPIM_T *spim, int isEn)
{
    uint8_t cmdBuf[3];
    uint8_t dataBuf[1], status1;

    cmdBuf[0] = 0x5U;                            /* Read Status Register-1 */

    SPIM_SET_SS_EN(spim, 1);
    SwitchNBitOutput(spim, 1UL);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(spim, 1UL);
    spim_read(spim, dataBuf, sizeof(dataBuf));
    SPIM_SET_SS_EN(spim, 0);
    /* SPIM_DBGMSG("SR1 = 0x%x\n", dataBuf[0]); */

    status1 = dataBuf[0];

    cmdBuf[0] = 0x35U;                           /* Read Configuration Register-1 */

    SPIM_SET_SS_EN(spim, 1);
    SwitchNBitOutput(spim, 1UL);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(spim, 1UL);
    spim_read(spim, dataBuf, sizeof(dataBuf));
    SPIM_SET_SS_EN(spim, 0);
    /* SPIM_DBGMSG("CR1 = 0x%x\n", dataBuf[0]); */

    SPIM_Set_Write_Enable(spim, 1, 1UL);

    cmdBuf[0] =  0x1U;                           /* Write register   */
    cmdBuf[1] =  status1;

    if (isEn)
    {
        cmdBuf[2] = dataBuf[0] | 0x2U;           /* set QUAD         */
    }
    else
    {
        cmdBuf[2] = dataBuf[0] & ~0x2U;          /* clear QUAD       */
    }

    SPIM_SET_SS_EN(spim, 1);
    SwitchNBitOutput(spim, 1UL);
    spim_write(spim, cmdBuf, 3UL);
    SPIM_SET_SS_EN(spim, 0);

    SPIM_Set_Write_Enable(spim, 0, 1UL);


    cmdBuf[0] = 0x35U;                           /* Read Configuration Register-1 */

    SPIM_SET_SS_EN(spim, 1);
    SwitchNBitOutput(spim, 1UL);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(spim, 1UL);
    spim_read(spim, dataBuf, sizeof(dataBuf));
    SPIM_SET_SS_EN(spim, 0);

    /* SPIM_DBGMSG("CR1 = 0x%x\n", dataBuf[0]); */
    N_delay(10000);
}

/** @endcond HIDDEN_SYMBOLS */

/**
  * @brief      Set Wrap Around Enable/disable.
  * @param      isEn        Enable/disable.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
int SPIM_SetWrapAroundEnable(SPIM_T *spim, int isEn, uint32_t u32WaBit)
{
    //uint32_t u32TimeOutCount = 0;
    uint32_t u32CmdBuf[2] = {0x00000000, 0x11011101};

    SPIM_SetQuadEnable(spim, 1, 1);

    SPIM_SET_SS_EN(spim, 1);

    spim->TX[0] = (u32CmdBuf[0] | (1 << 28));

    if (isEn == 1)
    {
        spim->TX[0] = ((u32CmdBuf[0] & ~(1 << 28)) | (1 << 29));
    }

    spim->TX[1] = 0x11011101;

    SwitchNBitOutput(spim, 4UL);
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);    /* Switch to Normal mode. */
    SPIM_SET_DATA_WIDTH(spim, 32UL);
    SPIM_SET_DATA_NUM(spim, 2);

    if (SPIM_WaitSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    //SPIM_SET_GO(spim);
    //u32TimeOutCount = SPIM_TIMEOUT;
    //SPIM_WAIT_FREE(spim)
    //{
    //    if (--u32TimeOutCount == 0)
    //        return SPIM_ERR_TIMEOUT;
    //}

    SPIM_SET_SS_EN(spim, 0);

    SPIM_SetQuadEnable(spim, 0, 1);

    return 0;
}

/**
  * @brief      Set Quad Enable/disable.
  * @param      isEn        Enable/disable.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_SetQuadEnable(SPIM_T *spim, int isEn, uint32_t u32NBit)
{
    uint8_t  idBuf[3];
    uint8_t  dataBuf[2];

    SPIM_ReadJedecId(spim, idBuf, sizeof(idBuf), u32NBit);

    SPIM_DBGMSG("SPIM_SetQuadEnable - Flash ID is 0x%x\n", idBuf[0]);

    switch (idBuf[0])
    {
        case MFGID_WINBOND:                      /* Winbond SPI flash  */
            SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
            SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
            SPIM_DBGMSG("Status Register: 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);

            if (isEn)
            {
                dataBuf[1] |= SR2_QE;
            }
            else
            {
                dataBuf[1] &= ~SR2_QE;
            }

            SPIM_Set_Write_Enable(spim, 1, u32NBit);   /* Write Enable.    */
            SPIM_WriteStatusRegister2(spim, dataBuf, sizeof(dataBuf), u32NBit);
            SPIM_Wait_Write_Done(spim, u32NBit);

            SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
            SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
            SPIM_DBGMSG("Status Register: 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);
            break;

        case MFGID_MXIC:                         /* MXIC SPI flash.  */
        case MFGID_EON:
        case MFGID_ISSI:                               /* ISSI SPI flash.  */
            SPIM_Set_Write_Enable(spim, 1, u32NBit);   /* Write Enable.    */
            dataBuf[0] = isEn ? SR_QE : 0U;
            SPIM_WriteStatusRegister(spim, dataBuf, sizeof(dataBuf), u32NBit);
            SPIM_Wait_Write_Done(spim, u32NBit);
            break;

        case MFGID_SPANSION:
            spim_enable_spansion_quad_mode(spim, isEn);
            break;

        default:
            break;
    }
}

/**
  * @brief      Enter/exit QPI mode.
  * @param      isEn        Enable/disable.
  * @return     None.
  */
static void spim_eon_set_qpi_mode(SPIM_T *spim, int isEn)
{
    uint8_t cmdBuf[1];                           /* 1-byte command.  */

    uint8_t status[1];
    SPIM_ReadStatusRegister(spim, status, sizeof(status), 1UL);
    SPIM_DBGMSG("Status: 0x%x\n", status[0]);

    if (isEn)                                    /* Assume in SPI mode. */
    {
        cmdBuf[0] = OPCODE_ENQPI;

        SPIM_SET_SS_EN(spim, 1);                      /* CS activated.    */
        SwitchNBitOutput(spim, 1UL);
        spim_write(spim, cmdBuf, sizeof(cmdBuf));
        SPIM_SET_SS_EN(spim, 0);                      /* CS deactivated.  */
    }
    else                                         /* Assume in QPI mode. */
    {
        cmdBuf[0] = OPCODE_EXQPI;

        SPIM_SET_SS_EN(spim, 1);                      /* CS activated.    */
        SwitchNBitOutput(spim, 4UL);
        spim_write(spim, cmdBuf, sizeof(cmdBuf));
        SPIM_SET_SS_EN(spim, 0);                      /* CS deactivated.  */
    }

