wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    SPIM_Set_Write_Enable(spim, 1, u32NBit);           /* Write Enable.    */

    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */
    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */

    if (isSync)
    {
        SPIM_Wait_Write_Done(spim, u32NBit);
    }
}

/**
  * @brief      Erase one block.
  * @param      u32Addr         Block to erase which contains the u32Addr.
  * @param      is4ByteAddr     4-byte u32Address or not.
  * @param      u8ErsCmd        Erase command.
  * @param      u32NBit         N-bit transmit/receive.
  * @param      isSync      Block or not.
  * @return     None.
  */
void SPIM_EraseBlock(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr, uint8_t u8ErsCmd, uint32_t u32NBit, int isSync)
{
    uint8_t  cmdBuf[16];
    uint32_t  buf_idx = 0UL;

    SPIM_Set_Write_Enable(spim, 1, u32NBit);           /* Write Enable.    */

    cmdBuf[buf_idx++] = u8ErsCmd;

    if (is4ByteAddr)
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr & 0xFFUL);
    }
    else
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr & 0xFFUL);
    }

    SPIM_SET_SS_EN(spim, 1);                      /* CS activated.    */
    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, buf_idx);
    SPIM_SET_SS_EN(spim, 0);                      /* CS deactivated.  */

    if (isSync)
    {
        SPIM_Wait_Write_Done(spim, u32NBit);
    }
}

#if 0
void SPIM_SetOctalDDRMode(SPIM_T *spim, uint32_t u32IOMode, uint32_t u32NBit)
{
    uint8_t u8RegBuf[1] = {0};
    uint8_t idBuf[3];
    uint8_t cmdBuf[1];                           /* 1-byte Enter/Exit 4-Byte Mode command. */
    int32_t i32TimeOutCount = 0;

    SPIM_ReadJedecId(spim, idBuf, sizeof(idBuf), u32NBit);

    SPIM_Set_Write_Enable(spim, 1, 1);

    /* Based on Flash size, check if 4-byte address mode is supported. */
    switch (idBuf[0])
    {
        case MFGID_MICRON:
            u8RegBuf[0] = u32IOMode;
            SPIM_WriteConfigRegister(spim, 0x81, u8RegBuf, 1, 1);

            u8RegBuf[0] = 0;
            SPIM_ReadConfigRegister(spim, 0, u8RegBuf, 1, 1);

            printf(" volatial register addr = 0x%02x, value = 0x%02x\r\n",
                   0,
                   u8RegBuf[0]);
            break;

        default:
            break;
    }

    SPIM_Set_Write_Enable(spim, 0, 1);

}
#endif //0

/** @cond HIDDEN_SYMBOLS */

/**
  * @brief      Write data in the same page by I/O mode.
  * @param      u32Addr     Start u32Address to write.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @param      u32NBitCmd  N-bit transmit command.
  * @param      u32NBitAddr N-bit transmit u32Address.
  * @param      u32NBitDat  N-bit transmit/receive data.
  * @param      isSync      Block or not.
  * @return     None.
  */
static void SPIM_WriteInPageDataByIo(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr, uint32_t u32NTx, uint8_t pu8TxBuf[], uint8_t wrCmd,
                                     uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat, int isSync)
{
    uint8_t   cmdBuf[16];
    uint32_t  buf_idx;

    SPIM_Set_Write_Enable(spim, 1, u32NBitCmd);        /* Write Enable.    */

    SPIM_SET_SS_EN(spim, 1);                           /* CS activated.    */

    SwitchNBitOutput(spim, u32NBitCmd);
    cmdBuf[0] = wrCmd;
    spim_write(spim, cmdBuf, 1UL);                     /* Write out command. */

    buf_idx = 0UL;

    if (is4ByteAddr)
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    }
    else
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    }

    SwitchNBitOutput(spim, u32NBitAddr);
    spim_write(spim, cmdBuf, buf_idx);                 /* Write out u32Address. */

    SwitchNBitOutput(spim, u32NBitDat);
    spim_write(spim, pu8TxBuf, u32NTx);                /* Write out data.  */

    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */

    if (isSync)
    {
        SPIM_Wait_Write_Done(spim, u32NBitCmd);
    }

    if (u32NBitCmd == 4UL)
    {
        SPIM_SET_DTR_MODE(spim, 0);
    }
}

/**
  * @brief      Write data in the same page by Page Write mode.
  * @param      u32Addr     Start u32Address to write.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @param      isSync      Block or not.
  * @retval     SPIM_OK          SPIM operation OK.
  * @retval     SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets g_SPIM_i32ErrCode to SPIM_TIMEOUT_ERR if waiting SPIM time-out.
  */
static int32_t SPIM_WriteInPageDataByPageWrite(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr, uint32_t u32NTx,
                                               uint8_t pu8TxBuf[], uint32_t wrCmd, int isSync)
{
    //uint32_t u32TimeOutCount;

    //if ((wrCmd == CMD_QUAD_PAGE_PROGRAM_WINBOND) ||
    //        (wrCmd == CMD_QUAD_PAGE_PROGRAM_MXIC))
    //{
    //    SPIM_SetQuadEnable(spim, 1, 1UL);              /* Set Quad Enable. */
    //}
    //else if (wrCmd == CMD_QUAD_PAGE_PROGRAM_EON)
    //{
    //    SPIM_SetQuadEnable(spim, 1, 1UL);              /* Set Quad Enable. */
    //    spim_eon_set_qpi_mode(spim, 1);                /* Enter QPI mode.  */
    //}

