wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    SPIM_Set_Write_Enable(spim, 1, 1);   /* Write Enable.    */

    SPIM_SET_4BYTE_ADDR_EN(spim, is4ByteAddr);        /* Enable/disable 4-Byte Address.  */

    SPIM_SET_SPIM_MODE(spim, wrCmd);                  /* SPIM mode.       */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEWRITE);/* Switch to Page Write mode.   */

    spim->SRAMADDR = (uint32_t)pu8TxBuf;         /* SRAM u32Address. */
    spim->DMACNT = u32NTx;                       /* Transfer length. */
    spim->FADDR = u32Addr;                       /* Flash u32Address.*/

    if (SPIM_WaitSPIMENDone(spim, isSync) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    //SPIM_SET_GO(spim);                           /* Go.              */
    //if (isSync)
    //{
    //u32TimeOutCount = SPIM_TIMEOUT;

    //SPIM_WAIT_FREE(spim)
    //{
    //    if (--u32TimeOutCount == 0) return SPIM_ERR_TIMEOUT;
    //}
    //}

    //if (wrCmd == CMD_QUAD_PAGE_PROGRAM_EON)
    //{
    //    spim_eon_set_qpi_mode(spim, 0); /* Exit QPI mode.   */
    //}

    //SPIM_Wait_Write_Done(spim, 1);

    return SPIM_OK;
}

/** @endcond HIDDEN_SYMBOLS */

/**
  * @brief      Write data to SPI Flash by sending commands manually (I/O mode).
  * @param      u32Addr: Start u32Address to write.
  * @param      is4ByteAddr: 4-byte u32Address or not.
  * @param      u32NTx: Number of bytes to write.
  * @param      pu8TxBuf: Transmit buffer.
  * @param      wrCmd: Write command.
  * @param      u32NBitCmd: N-bit transmit command.
  * @param      u32NBitAddr: N-bit transmit u32Address.
  * @param      u32NBitDat: N-bit transmit/receive data.
  * @return     None.
  */
void SPIM_IO_Write(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr, uint32_t u32NTx, uint8_t pu8TxBuf[], uint8_t wrCmd,
                   uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat)
{
    uint32_t  pageOffset, toWr;
    uint32_t  buf_idx = 0UL;

    pageOffset = u32Addr % 256UL;

    if ((pageOffset + u32NTx) <= 256UL)          /* Do all the bytes fit onto one page ? */
    {
        SPIM_WriteInPageDataByIo(spim, u32Addr, is4ByteAddr, u32NTx, &pu8TxBuf[buf_idx],
                                 wrCmd, u32NBitCmd, u32NBitAddr, u32NBitDat, 1);
    }
    else
    {
        toWr = 256UL - pageOffset;               /* Size of data remaining on the first page. */

        SPIM_WriteInPageDataByIo(spim, u32Addr, is4ByteAddr, toWr, &pu8TxBuf[buf_idx],
                                 wrCmd, u32NBitCmd, u32NBitAddr, u32NBitDat, 1);
        u32Addr += toWr;                         /* Advance indicator.  */
        u32NTx -= toWr;
        buf_idx += toWr;

        while (u32NTx)
        {
            toWr = 256UL;

            if (toWr > u32NTx)
            {
                toWr = u32NTx;
            }

            SPIM_WriteInPageDataByIo(spim, u32Addr, is4ByteAddr, toWr, &pu8TxBuf[buf_idx],
                                     wrCmd, u32NBitCmd, u32NBitAddr, u32NBitDat, 1);
            u32Addr += toWr;                 /* Advance indicator.  */
            u32NTx -= toWr;
            buf_idx += toWr;
        }
    }
}

uint32_t SPIM_GetIOPhaseSize(uint32_t u32Phase)
{
    switch (u32Phase)
    {
        case PHASE_DUAL_MODE:
            return 2;

        case PHASE_QUAD_MODE:
            return 4;

        case PHASE_OCTAL_MODE:
            return 8;

        default:
        case PHASE_NORMAL_MODE:
            return 1;
    }

    return 1;
}

void SPIM_IO_DataPhase(SPIM_T *spim,
                       uint8_t u8TRxBuf[],
                       uint32_t u32TRxSize,
                       uint32_t u32DataPhase,
                       uint32_t u32DTRMode,
                       uint32_t isSync)
{
    //uint8_t u8CmdBuf[1] = {0};

    SPIM_SET_DTR_MODE(spim, u32DTRMode); /* DTR Activated. */
    //SPIM_SET_RDQS_MODE(spim, u32DTRMode);

    if (isSync == 1)
    {
        SwitchNBitOutput(spim, SPIM_GetIOPhaseSize(u32DataPhase));
        spim_write(spim, u8TRxBuf, u32TRxSize);                /* Write out data.  */
    }
    else
    {
        SwitchNBitInput(spim, SPIM_GetIOPhaseSize(u32DataPhase));
        spim_read(spim, u8TRxBuf, u32TRxSize);   /* Read back data.  */
    }

    SPIM_SET_SS_EN(spim, 0);    /* CS Deactivated. */
    SPIM_SET_DTR_MODE(spim, 0); /* DTR Deactivated. */
    SPIM_SET_RDQS_MODE(spim, 0);

    //if (isSync)
    //{
    //    SPIM_Wait_Write_Done(spim, u32DataPhase);
    //}
}

void SPIM_IO_DCPhase(SPIM_T *spim,
                     uint32_t u32NDummy,
                     uint32_t u32DcPhase,
                     uint32_t u32DTRMode)
{
    uint8_t u8CmdBuf[32] =
    {
        0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA,
        0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA,
        0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA,
        0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA
    };

    if (u32NDummy == 0)
    {
        return;
    }

    SPIM_SET_DTR_MODE(spim, u32DTRMode); /* DTR Activated. */

    SwitchNBitInput(spim, SPIM_GetIOPhaseSize(u32DcPhase));

    /* Same bit mode as above. */
    spim_write(spim, u8CmdBuf, u32NDummy);  /* Write out dummy bytes. */

    SPIM_SET_DTR_MODE(spim, 0); /* DTR Deactivated. */
}

void SPIM_IO_AddrPhase(SPIM_T *spim,
                       uint32_t u32Is4ByteAddr,
                       uint32_t u32Addr,
                       uint32_t u32AddrPhase,
                       uint32_t u32DTRMode)
{
    uint8_t u8CmdBuf[8] = {0};
    uint8_t u8BufIdx = 0;

    SPIM_SET_DTR_MODE(spim, u32DTRMode); /* DTR Activated. */

    if (u32Is4ByteAddr)
    {
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 24);
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 16);
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 8);
        u8CmdBuf[u8BufIdx++] = (uint8_t) u32Addr;

    }
    else
    {
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 16);
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 8);
        u8CmdBuf[u8BufIdx++] = (uint8_t) u32Addr;
    }

    if (((SPIM_GetIOPhaseSize(u32AddrPhase) == 2) ||
            (SPIM_GetIOPhaseSize(u32AddrPhase) == 4)) /*&&
        (gu8MFGID == MFGID_WINBOND)*/)
    {
        u8BufIdx++;
    }

