wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    SwitchNBitOutput(spim, SPIM_GetIOPhaseSize(u32AddrPhase));
    spim_write(spim, u8CmdBuf, u8BufIdx);  /* Write out u32Address. */

    SPIM_SET_DTR_MODE(spim, 0); /* DTR Deactivated. */
}

void SPIM_IO_CMDPhase(SPIM_T *spim,
                      uint32_t u32RdCMD,
                      uint32_t u32CMDPhase,
                      uint32_t u32DTRMode,
                      uint32_t isSync)
{
    uint8_t u8CmdBuf[2] = {0};
    uint8_t u8CmdSize = 1UL;

    SPIM_SET_DTR_MODE(spim, u32DTRMode); /* DTR Activated. */

    if (isSync == 1)
    {
        SPIM_Set_Write_Enable(spim, 1, SPIM_GetIOPhaseSize(u32CMDPhase));        /* Write Enable.    */
    }

    SPIM_SET_SS_EN(spim, 1);    /* CS activated. */

    u8CmdBuf[0] = (u32RdCMD & 0xFF);

    if (u32DTRMode == 1)
    {
        u8CmdBuf[1] = 0x00;
        u8CmdSize = 2UL;
    }

    SwitchNBitOutput(spim, SPIM_GetIOPhaseSize(u32CMDPhase));
    spim_write(spim, u8CmdBuf, u8CmdSize);    /* Write out command. */

    //SPIM_SET_SS_EN(spim, 0);    /* CS Deactivated. */
    SPIM_SET_DTR_MODE(spim, 0); /* DTR Deactivated. */
}

/**
  * @brief      Read data from SPI Flash by sending commands manually (I/O mode).
  * @param      u32Addr     Start u32Address to read.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NRx      Number of bytes to read.
  * @param      pu8RxBuf    Receive buffer.
  * @param      rdCmd       Read command.
  * @param      u32NBitCmd  N-bit transmit command.
  * @param      u32NBitAddr N-bit transmit u32Address.
  * @param      u32NBitDat  N-bit transmit/receive data.
  * @param      u32NDummy   Number of dummy bytes following address.
  * @return     None.
  */
void SPIM_IO_Read(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr, uint32_t u32NRx, uint8_t pu8RxBuf[], uint8_t rdCmd,
                  uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat, int u32NDummy, uint32_t u32DTRMode)
{
    uint8_t cmdBuf[16] = {0};
    uint32_t buf_idx;

    SPIM_SET_SS_EN(spim, 1);                      /* CS activated.    */

    cmdBuf[0] = rdCmd;
    SwitchNBitOutput(spim, u32NBitCmd);
    spim_write(spim, cmdBuf, 1UL);                /* Write out command. */

    buf_idx = 0UL;

    if (is4ByteAddr)
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    }
    else
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    }

    //while (u32NDummy--)
    {
        buf_idx += u32NDummy;
        //cmdBuf[buf_idx++] = 0x00U;  /* Write out dummy bytes. */
    }

    SwitchNBitOutput(spim, u32NBitAddr);
    spim_write(spim, cmdBuf, buf_idx);                 /* Write out u32Address. */

    //buf_idx = 0UL;

    /* Same bit mode as above. */
    //spim_write(spim, cmdBuf, buf_idx);  /* Write out dummy bytes. */

    SwitchNBitInput(spim, u32NBitDat);
    spim_read(spim, pu8RxBuf, u32NRx);  /* Read back data.  */

    SPIM_SET_SS_EN(spim, 0);    /* CS deactivated.  */

    //if (u32NBitCmd == 4UL)
    //{
    //    SPIM_SET_DTR_MODE(spim, 0);
    //}
}

/**
  * @brief      Write data to SPI Flash by Page Write mode.
  * @param      u32Addr     Start address to write.
  * @param      is4ByteAddr 4-byte address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @return     None.
  */
void SPIM_DMA_Write(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr, uint32_t u32NTx, uint8_t pu8TxBuf[], uint32_t wrCmd)
{
    uint32_t   pageOffset, toWr;
    uint32_t   buf_idx = 0UL;

    pageOffset = u32Addr % 256UL;

    if ((pageOffset + u32NTx) <= 256UL)
    {
        /* Do all the bytes fit onto one page ? */
        SPIM_WriteInPageDataByPageWrite(spim, u32Addr, is4ByteAddr, u32NTx, pu8TxBuf, wrCmd, 1);
    }
    else
    {
        toWr = 256UL - pageOffset;               /* Size of data remaining on the first page. */

        SPIM_WriteInPageDataByPageWrite(spim, u32Addr, is4ByteAddr, toWr, &pu8TxBuf[buf_idx], wrCmd, 1);

        u32Addr += toWr;                         /* Advance indicator. */
        u32NTx -= toWr;
        buf_idx += toWr;

        while (u32NTx)
        {
            toWr = 256UL;

            if (toWr > u32NTx)
            {
                toWr = u32NTx;
            }

            SPIM_WriteInPageDataByPageWrite(spim, u32Addr, is4ByteAddr, toWr, &pu8TxBuf[buf_idx], wrCmd, 1);

            u32Addr += toWr;                 /* Advance indicator. */
            u32NTx -= toWr;
            buf_idx += toWr;
        }
    }
}

/**
  * @brief      Read data from SPI Flash by Page Read mode.
  * @param      u32Addr     Start address to read.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NRx      Number of bytes to read.
  * @param      pu8RxBuf    Receive buffer.
  * @param      u32RdCmd    Read command.
  * @param      isSync      Block or not.
  * @retval     SPIM_OK          SPIM operation OK.
  * @retval     SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets g_SPIM_i32ErrCode to SPIM_TIMEOUT_ERR if waiting SPIM time-out.
  */
int32_t SPIM_DMA_Read(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr, uint32_t u32NRx, uint8_t pu8RxBuf[],
                      uint32_t u32RdCmd, int isSync)
{
    //uint32_t u32TimeOutCount;

    SPIM_SET_4BYTE_ADDR_EN(spim, is4ByteAddr);        /* Enable/disable 4-Byte Address. */

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEREAD); /* Switch to Page Read mode.      */

    SPIM_SET_SPIM_MODE(spim, u32RdCmd);               /* SPIM mode.                     */

    spim->SRAMADDR = (uint32_t) pu8RxBuf;        /* SRAM u32Address. */
    spim->DMACNT = u32NRx;                       /* Transfer length. */
    spim->FADDR = u32Addr;                       /* Flash u32Address.*/

