wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    if (SPIM_WaitSPIMENDone(spim, isSync) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    //SPIM_SET_GO(spim);                           /* Go.              */
    //if (isSync)
    //{
    //    u32TimeOutCount = SPIM_TIMEOUT;//(u32NRx * 0x80);//SPIM_TIMEOUT;
    //    SPIM_WAIT_FREE(spim)                       /* Wait for DMA done.  */
    //    {
    //        if (--u32TimeOutCount == 0) return SPIM_ERR_TIMEOUT;
    //    }
    //}

    return SPIM_OK;
}

/**
  * @brief      Enter Direct Map mode.
  * @param      is4ByteAddr     4-byte u32Address or not.
  * @param      u32RdCmd        Read command.
  * @param      u32IdleIntvl    Idle interval.
  * @return     None.
  */
void SPIM_EnterDirectMapMode(SPIM_T *spim, int is4ByteAddr, uint32_t u32RdCmd, uint32_t u32IdleIntvl)
{
    SPIM_SET_4BYTE_ADDR_EN(spim, is4ByteAddr);           /* Enable/disable 4-byte u32Address. */
    SPIM_SET_SPIM_MODE(spim, u32RdCmd);                  /* SPIM mode.       */
    SPIM_SET_IDL_INTVL(spim, u32IdleIntvl);              /* Idle interval.   */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_DIRECTMAP);   /* Switch to Direct Map mode.     */
}

/**
  * @brief      Exit Direct Map mode.
  * @return     None.
  */
int SPIM_ExitDirectMapMode(SPIM_T *spim)
{
    //uint32_t u32TimeOutCount = 0;
    uint32_t u32CmdBuf = 0xFFFFFFFF;
    spim->TX[0] = u32CmdBuf;

    SPIM_SetQuadEnable(spim, 1, 1);

    SPIM_SET_SS_EN(spim, 1);

    SwitchNBitOutput(spim, 4UL);
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);    /* Switch to Normal mode. */
    SPIM_SET_DATA_WIDTH(spim, 32UL);
    SPIM_SET_DATA_NUM(spim, 1);

    if (SPIM_WaitSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    //SPIM_SET_GO(spim);
    //u32TimeOutCount = SPIM_TIMEOUT;
    //SPIM_WAIT_FREE(spim)
    //{
    //    if (--u32TimeOutCount == 0)
    //        return SPIM_ERR_TIMEOUT;
    //}

    SPIM_SET_SS_EN(spim, 0);

    SPIM_SetQuadEnable(spim, 0, 1);

    spim->TX[0] = u32CmdBuf;
    SPIM_SET_SS_EN(spim, 1);

    SwitchNBitOutput(spim, 2UL);
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);    /* Switch to Normal mode. */
    SPIM_SET_DATA_WIDTH(spim, 32UL);
    SPIM_SET_DATA_NUM(spim, 1);

    if (SPIM_WaitSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    //SPIM_SET_GO(spim);
    //u32TimeOutCount = SPIM_TIMEOUT;
    //SPIM_WAIT_FREE(spim)
    //{
    //    if (--u32TimeOutCount == 0)
    //        return SPIM_ERR_TIMEOUT;
    //}

    SPIM_SET_SS_EN(spim, 0);

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO); /* Switch back to Normal mode.  */

#if 0
    uint8_t cmdBuf[3] = {0x0F, 0xFF, 0xFF};

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO); /* Switch back to Normal mode.  */

    /* SPI Reset */
    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */

    SPIM_ENABLE_SING_OUTPUT_MODE(spim);               /* 1-bit, Output.   */

    spim_write(spim, cmdBuf, sizeof(cmdBuf));

    SPIM_SET_SS_EN(spim, 0);

    uint8_t cmdBuf[4] = {0xFF, 0xFF, 0xFF, 0xFF};

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO); /* Switch back to Normal mode.  */
    SPIM_ENABLE_QUAD_OUTPUT_MODE(spim);         /* Switch back to Normal mode.  */
    SPIM_SET_DATA_NUM(spim, 0);
    SPIM_SET_DATA_WIDTH(spim, 32UL);

    SPIM_SET_SS_EN(spim, 1);                          /* CS activated. */
    SwitchNBitOutput(spim, 4);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(spim, 0);

    SPIM_DMM_DISABLE_BWEN(spim);
#endif //0

    return 0;
}

/**
  * @brief      SPIM used to delay the read data strobe (DQS/RWDS) from Octal SPI Flash and Hyper bus device
  * @param      spim
  * @param      u32OutValid   Clock Cycle Number between DLL Lock and DLL Output Valid
  * @param      u32LockTime   Clock Cycle Number between DLL Clock Divider Enable and DLL Lock
  * @param      u32ClkOnNum   Clock Cycle Number between DLL OLDO Enable and DLL Clock Divider Enable
  * @param      u32DelayNum   DLL Delay Step Number
  * @return     None.
  * @note       First fix DIVIDER to set the frequency of SPIM output bus clock.
  */
void SPIM_CtrlDLLDelayTime(SPIM_T *spim, uint32_t u32ClkOnNum, uint32_t u32TrimNum, uint32_t u32LKNum, uint32_t u32OVNum, uint32_t u32DelayNum)
{
    int i32Timeout = SPIM_TIMEOUT;

    /* The default value of CLKONNUM is 0x07D0 when frequency of DLL reference clock
       is 100 MHz and enable time of DLL clock divider is 20us */
    if (u32ClkOnNum != 0)
    {
        SPIM_SET_DLL2_CLKON_NUM(spim, u32ClkOnNum);
    }

    if (u32TrimNum != 0)
    {
        SPIM_SET_DLL2_TRIM_NUM(spim, u32TrimNum);
    }

    /* The default value of DLLLKNUM is 0x07D0 when frequency of DLL reference clock
       is 100 MHz and DLL lock time is 20us. */
    if (u32LKNum != 0)
    {
        SPIM_SET_DLL1_LOCKK_VALID(spim, u32LKNum);
    }

    if (u32OVNum != 0)
    {
        SPIM_SET_DLL1_OUT_VALID(spim, u32OVNum);
    }

    /* SPIM starts to send DLL reference clock to DLL circuit
       that the frequency is the same as the SPIM output bus clock. */
    SPIM_ENABLE_DLL0_OLDO(spim, 1);

    /* User asserts this control register to 0x1,
       the DLL circuit begins searching for lock with DLL reference clock. */
    SPIM_ENABLE_DLL0_OVRST(spim, 1);

    i32Timeout = SPIM_TIMEOUT;

    /* Polling the DLL status register DLLCKON to 0x1,
       and the value 0x1 indicates that clock divider circuit inside DLL is enabled. */
    while (SPIM_WAIT_DLL0_CLKON(spim) != 1)
    {
        if (i32Timeout-- <= 0)
        {
            break;
        }
    }

    i32Timeout = SPIM_TIMEOUT;

    /* Polling the DLL status register DLLLOCK to 0x1,
       and the value 0x1 indicates that DLL circuit is in lock state */
    while (SPIM_WAIT_DLL0_LOCK(spim) != 1)
    {
        if (i32Timeout-- <= 0)
        {
            break;
        }
    }

    i32Timeout = SPIM_TIMEOUT;

    /* Polling the DLL status register DLLREADY to 0x1,
       and the value 0x1 indicates that output of DLL circuit is ready. */
    while (SPIM_WAIT_DLL0_READY(spim) != 1)
    {
        if (i32Timeout-- <= 0)
        {
            break;
        }
    }

    /* Set this valid delay number to control register DLL_DNUM. */
    SPIM_SET_DLL0_DELAY_NUM(spim, u32DelayNum);

    i32Timeout = SPIM_TIMEOUT;

    /* Polling DLL status register DLL_REF to 1
       to know the updating flow of DLL delay step number is finish or not. */
    while (SPIM_WAIT_DLL0_REFRESH(spim) != 0)
    {
        if (i32Timeout-- <= 0)
        {
            break;
        }
    }
}

//------------------------------------------------------------------------------
// SPIM Hyper Define Function Prototypes
//------------------------------------------------------------------------------
int SPIM_Hyper_GetErrCode(void)
{
    return g_SPIM_Hyper_i32ErrCode;
}

void SPIM_Hyper_SetErrCode(int i32SetValue)
{
    g_SPIM_Hyper_i32ErrCode = i32SetValue;
}

/**
  * @brief      Reset hyper chip function
  * @param      spim
  * @return     None
  * @note       This function sets g_SPIM_Hyper_i32ErrCode to SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
void SPIM_Hyper_ResetHyperRAM(SPIM_T *spim)
{
    int32_t i32TimeOutCnt = SPIM_TIMEOUT;

    spim->HYPER_CMD = SPIM_HYPER_CMD_RESET_HRAM;

