wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    g_SPIM_Hyper_i32ErrCode = 0;

    while (spim->HYPER_CMD != SPIM_HYPER_CMD_HRAM_IDLE)
    {
        if (i32TimeOutCnt-- <= 0)
        {
            g_SPIM_Hyper_i32ErrCode = SPIM_ERR_TIMEOUT;
            break;
        }
    }
}

/**
  * @brief      Exit from Hybrid sleep and deep Power down function
  * @param      spim
  * @return     None
  * @note       This function sets g_SPIM_Hyper_i32ErrCode to SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
void SPIM_HyperRAM_ExitHSAndDPD(SPIM_T *spim)
{
    int32_t i32TimeOutCnt = SPIM_TIMEOUT;

    spim->HYPER_CMD = SPIM_HYPER_CMD_EXIT_HS_PD;

    g_SPIM_Hyper_i32ErrCode = 0;

    while (spim->HYPER_CMD != SPIM_HYPER_CMD_HRAM_IDLE)
    {
        if (i32TimeOutCnt-- <= 0)
        {
            g_SPIM_Hyper_i32ErrCode = SPIM_ERR_TIMEOUT;
            break;
        }
    }
}

/**
  * @brief      Read hyper chip register space
  * @param      spim
  * @param[in]  u32Addr  Address of hyper chip register space
  *                 - \ref HYPER_CHIP_ID_REG0       : 0x0000_0000 = Identification Register 0
  *                 - \ref HYPER_CHIP_ID_REG1       : 0x0000_0002 = Identification Register 1
  *                 - \ref HYPER_CHIP_CONFIG_REG0   : 0x0000_1000 = Configuration Register 0
  *                 - \ref HYPER_CHIP_CONFIG_REG1   : 0x0000_1002 = Configuration Register 1
  * @return   The data of hyper chip register.
  * @return   -1  An illeagal register space
  * @return   -2  Wait Hyper Chip time-out
  */
int32_t SPIM_HyperRAM_ReadReg(SPIM_T *spim, uint32_t u32Addr)
{
    int32_t i32TimeOutCnt = SPIM_TIMEOUT;

    if ((u32Addr == HYPER_CHIP_ID_REG0) ||
            (u32Addr == HYPER_CHIP_ID_REG1) ||
            (u32Addr == HYPER_CHIP_CONFIG_REG0) ||
            (u32Addr == HYPER_CHIP_CONFIG_REG1))
    {
        spim->HYPER_ADR = u32Addr;

        spim->HYPER_CMD = SPIM_HYPER_CMD_READ_HRAM_REGISTER;

        while (spim->HYPER_CMD != SPIM_HYPER_CMD_HRAM_IDLE)
        {
            if (i32TimeOutCnt-- <= 0)
            {
                return SPIM_ERR_TIMEOUT;
            }
        }
    }
    else
    {
        return -1;
    }

    return (spim->HYPER_RDATA & 0xFFFF);
}

/**
  * @brief      Write Hyper Chip register space
  * @param      spim
  * @param[in]  u32Addr  Address of Hyper Chip register space
  *                 - \ref HYPER_CHIP_ID_REG0       : 0x0000_0000 = Identification Register 0
  *                 - \ref HYPER_CHIP_ID_REG1       : 0x0000_0002 = Identification Register 1
  *                 - \ref HYPER_CHIP_CONFIG_REG0   : 0x0000_1000 = Configuration Register 0
  *                 - \ref HYPER_CHIP_CONFIG_REG1   : 0x0000_1002 = Configuration Register 1
  * @param[in]
  * @return   0   success.
  * @return   -1  An illeagal register space
  * @return   -2  Wait Hyper Chip time-out
  */
int32_t SPIM_HyperRAM_WriteReg(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Value)
{
    int32_t i32TimeOutCnt = SPIM_TIMEOUT;

    if ((u32Addr == HYPER_CHIP_ID_REG0) ||
            (u32Addr == HYPER_CHIP_ID_REG1) ||
            (u32Addr == HYPER_CHIP_CONFIG_REG0) ||
            (u32Addr == HYPER_CHIP_CONFIG_REG1))
    {
        spim->HYPER_WDATA &= ~0xFFFFFFFF;

        spim->HYPER_ADR = u32Addr;
        spim->HYPER_WDATA = u32Value;

        spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_HRAM_REGISTER;

        while (spim->HYPER_CMD != SPIM_HYPER_CMD_HRAM_IDLE)
        {
            if (i32TimeOutCnt-- <= 0)
            {
                return SPIM_ERR_TIMEOUT;
            }
        }
    }
    else
    {
        return -1;
    }

    return 0;
}

/**
  * @brief      Read 1 word from hyper chip space
  * @param      spim
  * @param[in]  u32Addr  Address of hyper chip space
  * @return     The 16 bit data of hyper chip space.
  * @note       This function sets g_SPIM_Hyper_i32ErrCode to SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
uint16_t SPIM_Hyper_Read1Word(SPIM_T *spim, uint32_t u32Addr)
{
    int32_t i32TimeOutCnt = SPIM_TIMEOUT;

    spim->HYPER_ADR = u32Addr;

    spim->HYPER_CMD = SPIM_HYPER_CMD_READ_HRAM_1_WORD;

    g_SPIM_Hyper_i32ErrCode = 0;

    while (spim->HYPER_CMD != SPIM_HYPER_CMD_HRAM_IDLE)
    {
        if (i32TimeOutCnt-- <= 0)
        {
            g_SPIM_Hyper_i32ErrCode = SPIM_ERR_TIMEOUT;
            break;
        }
    }

    return (spim->HYPER_RDATA & 0xFFFF);
}

/**
  * @brief      Read 2 word from hyper chip space
  * @param      spim
  * @param[in]  u32Addr  Address of hyper chip space
  * @return     The 32bit data of hyper chip space.
  */
uint32_t SPIM_Hyper_Read2Word(SPIM_T *spim, uint32_t u32Addr)
{
    int32_t i32TimeOutCnt = SPIM_TIMEOUT;

    spim->HYPER_ADR = u32Addr;

    spim->HYPER_CMD = SPIM_HYPER_CMD_READ_HRAM_2_WORD;

    g_SPIM_Hyper_i32ErrCode = 0;

    while (spim->HYPER_CMD != SPIM_HYPER_CMD_HRAM_IDLE)
    {
        if (i32TimeOutCnt-- <= 0)
        {
            g_SPIM_Hyper_i32ErrCode = SPIM_ERR_TIMEOUT;
            break;
        }
    }

    return spim->HYPER_RDATA;
}

/**
  * @brief      Write 1 byte to hyper chip space
  * @param      spim
  * @param[in]  u32Addr  Address of hyper chip space
  * @param[in]  u8Data   8 bits data to be written to hyper chip space
  * @return     None.
  * @note       This function sets g_SPIM_Hyper_i32ErrCode to SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
void SPIM_Hyper_Write1Byte(SPIM_T *spim, uint32_t u32Addr, uint8_t u8Data)
{
    int32_t i32TimeOutCnt = SPIM_TIMEOUT;

    spim->HYPER_WDATA &= ~0xFFFFFFFF;

    spim->HYPER_ADR = u32Addr;
    spim->HYPER_WDATA = u8Data;

    spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_HRAM_1_BYTE;

    g_SPIM_Hyper_i32ErrCode = 0;

    while (spim->HYPER_CMD != SPIM_HYPER_CMD_HRAM_IDLE)
    {
        if (i32TimeOutCnt-- <= 0)
        {
            g_SPIM_Hyper_i32ErrCode = SPIM_ERR_TIMEOUT;
            break;
        }
    }
}

/**
  * @brief      Write 2 bytes to Hyper Chip space
  * @param      spim
  * @param[in]  u32Addr  Address of Hyper Chip space
  * @param[in]  u16Data  16 bits data to be written to Hyper Chip space
  * @return     None.
  * @note       This function sets g_SPIM_Hyper_i32ErrCode to SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
void SPIM_Hyper_Write2Byte(SPIM_T *spim, uint32_t u32Addr, uint16_t u16Data)
{
    int32_t i32TimeOutCnt = SPIM_TIMEOUT;

    spim->HYPER_WDATA &= ~0xFFFFFFFF;

    spim->HYPER_ADR = u32Addr;
    spim->HYPER_WDATA = u16Data;

    spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_HRAM_2_BYTE;

